/*
Создание переменных:
Создайте переменную типа с плавающей точкой с наибольшим диапазоном чисел. Присвойте ей произвольное дробное значение.
Создайте переменную целочисленного типа с наименьшим диапазоном чисел. Присвойте ей наибольшее возможное значение.
     */

public class TaskWork02 {
    public static void main(String[] args) {
        //переменная типа с плавающей точкой с наибольшим диапазоном чисел
        double a = 15.4444;
        //переменная целочисленного типа с наименьшим диапазоном чисел
        byte b = 127;
    }
}
